/=#
#include "VFR.uni"

#string STR_DELAY_POST                     #language eng "Delayed POST (DXE phase)"
#string STR_DELAY_POST_HELP                #language eng "Enabled -\nRobot holds BIOS before POST completion. This allows BIOS POST to start with stable power or start after system is physically warmed-up.\n\nNote:  Robot does this after 'Sends watch dog before BIOS POST'."
#string STR_DELAY_POST_TIME                #language eng "  Delayed time (second)"
#string STR_DELAY_POST_TIME_HELP           #language eng "Period of time for Robot to hold BIOS from POST."

#string STR_DELAY_POST_PEI                     #language eng "Delayed POST (PEI phase)"
#string STR_DELAY_POST_PEI_HELP                #language eng "Enabled -\nRobot holds BIOS from starting POST, right after power on. This allows BIOS POST to start with stable power or start after system is physically warmed-up.\n\nNote:  Robot does this before 'Sends watch dog'."
#string STR_DELAY_POST_TIME_PEI                #language eng "  Delayed time (second)"
#string STR_DELAY_POST_TIME_PEI_HELP           #language eng "Period of time for Robot to hold BIOS from POST."

#string STR_RESET_ONCE                     #language eng "Reset system once"
#string STR_RESET_ONCE_HELP                     #language eng "Enabled -\nRobot resets system for one time on each boot. This will send a soft or hard reset to onboard devices, thus puts devices to more stable state."
#string STR_POWER_ON_RESET_TYPE                      #language eng "  Soft or hard reset"
#string STR_RESET_TYPE_HELP                      #language eng "Select reset type robot should send on each boot."
#string STR_RESET_TYPE_SOFT                #language eng "Soft reset"
#string STR_RESET_TYPE_HARD                #language eng "Hard reset"
